Autodesk.Revit.DB.FabricationService.OverrideServiceButtonExclusion(System.Int32,System.Int32,System.Boolean)
Overrides the default service button exclusions, used by Route and Fill, Design to Fabrication, or Multi Point Routing for the current user and session only.
paletteIndex:
The index of the service palette to exclude the service button from.
buttonIndex:
The index of the service button to exclude.
exclude:
Pass true to exclude from being used by Route and Fill or Design to Fabrication.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index paletteIndex is not larger or equal to 0 and less than PaletteCount.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.ResetServiceExclusionOverrides
Resets the overridden service palette and button exclusions back to default, as defined by the configuration.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.SetServicePaletteExclusions(System.Collections.Generic.IList{System.Int32})
Sets the service palette exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those palettes passed.
excludedPalettes:
A list of service palette indexes to be excluded.
Returns:
Returns true if succeeded to set the exclusions to the specified palette(s).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Palette indices contains an index that is not larger or equal to 0 and less than PaletteCount.
Since:
2022